alimleahat/IoT-BERT-for-Parcel-Tracking/esp32_firmware/sdkconfig.defaults
# Target: ESP32-S3
CONFIG_IDF_TARGET="esp32s3"

# WiFi credentials (override via menuconfig or sdkconfig.local)
CONFIG_WIFI_SSID="AliMleahat"
CONFIG_WIFI_PASSWORD=""

# Flask server URL
CONFIG_SERVER_URL="http://172.20.10.12:5001/api/intent"

# Flash: 8MB with custom partition table (large app for BERT model)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Increase main task stack for HTTP + TFLite
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# Enable PSRAM if available on your board
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
